# IsMaterialOrValidDefault Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Material..::..IsMaterialOrValidDefault Method
Material Class See Also
---
Validates whether the specified element id is a material element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static bool IsMaterialOrValidDefault(
	Element pElem,
	ElementId materialId
)
```

Visual Basic
---
```text
Public Shared Function IsMaterialOrValidDefault ( _
	pElem As Element, _
	materialId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsMaterialOrValidDefault(
	Element^ pElem,
	ElementId^ materialId
)
```

# ### Parameters
pElem
    Type: Autodesk.Revit.DB..::..Element An element which will be applied the material
materialId
    Type: Autodesk.Revit.DB..::..ElementId The element id to be checked.
# ### Return Value
True if the element a material element or invalidElementId, which means take material from category, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Material Class
Autodesk.Revit.DB Namespace